<?php

$event_ch1 = [
    'ด้านการให้บริการด้านวิชาการ/ด้านสื่อ' => [
        '1_1' => '๑. ความหลากหลายในการค้นคว้าของสื่อการเรียนรู้ต่าง ๆ เช่น คอมพิวเตอร์ ระบบอินเตอร์เน็ต ฐานข้อมูล เป็นต้น  ',
        '1_2' => '๒. การให้คำแนะนำ/ดูแลเอาใจใส่ของอาจารย์ที่ปรึกษา',
        '1_3' => '๓. การให้บริการทางวิชาการ/การจัดกิจกรรม/โครงการเพื่อประโยชน์แก่ผู้เรียน ',
        '1_4' => '๔. จำนวนหรือความเพียงพอของอุปกรณ / สื่อการเรียนการสอน ',
        '1_5' => '๕. สื่อ/เอกสารและอุปกรณ์การเรียนการสอนมีความชัดเจนและเข้าใจง่าย'
    ],
    'ด้านอาคารสถานที่และสิ่งแวดล้อม' => [
        '2_1' => '๑. สภาพแวดล้อมภายในห้องเรียน/ห้องปฏิบัติการโดยรวม ( เช่น ความสะอาด  การถ่ายเทอากาศ)  ',
        '2_2' => '๒. สภาพแวดล้อมภายนอกห้องเรียนโดยรวม          ( เช่น ความสะอาด ความสงบร่มรื่น)',
        '2_3' => '๓. ขนาดของห้องเรียนมีความเหมาะสมและ         มีอุปกรณ์ เช่น โต๊ะ เก้าอี้ เพียงพอกับจำนวนผู้เรียน',
        '2_4' => '๔. อาคาร ห้องเรียนมีความเหมาะสมและจำนวนเพียงพอ',
        '2_5' => '๕. สภาพแวดล้อมภายในห้องน้ำ/ห้องสุขาโดยรวม    ( เช่น ความสะอาด แสง การถ่ายเทอากาศ)',
        '2_6' => '๖. สถานที่จอดรถมีความเพียงพอและปลอดภัย',
        '2_7' => '๗. สภาพแวดล้อมโดยทั่วไปเหมาะสมกับการเรียนรู้',
    ]
];


$event_ch2_1 = [
    'แบบประเมินตนเอง' => [
        '1_1' => '๑. เข้าเรียนตรงเวลาสม่ำเสมอ',
        '1_2' => '๒. เตรียมตัวล่วงหน้าก่อนเข้าเรียน',
        '1_3' => '๓. ทำความเข้าใจเกี่ยวกับเนื้อหาวิชาที่เรียน',
        '1_4' => '๔. ซักถามข้อสงสัยในขณะที่เรียน',
        '1_5' => '๕. ทำงานที่ได้รับมอบหมายและส่งงานทุกครั้ง',
        '1_6' => '๖. ค้นคว้าและเรียนรู้เพิ่มเติมด้วยตนเอง',
        '1_7' => '๗. ทำงานร่วมกับผู้อื่นในบทบาทผู้นำและผู้ตาม',
        '1_8' => '๘. วางแผนการทำงานอย่างเป็นระบบ',
        '1_9' => '๙. สร้างความรู้ที่เป็นประโยชน์ด้วยตนเอง',
        '1_10' => '๑๐. นำความรู้ที่เรียนไปประยุกต์ใช้ในการทำงาน'
    ]
];

$event_ch2_2 = [
    'แบบประเมินผู้สอน' => [
        '2_1' => '๑. แนวการสอนที่ชัดเจนและครอบคลุม',
        '2_2' => '๒. สร้างความเข้าใจวัตถุประสงค์ของรายวิชาตั้งแต่เริ่มสอน',
        '2_3' => '๓. มีความรู้ในเนื้อหาวิชา',
        '2_4' => '๔. สามารถถ่ายทอดความรู้ให้เข้าใจได้',
        '2_5' => '๕. มีความสามารถในการจูงใจการเรียนของผู้เรียน',
        '2_6' => '๖. กระตุ้นให้นักศึกษารู้จักวิเคราะห์และวิจารณ์',
        '2_7' => '๗. สามารถอธิบายและ/หรือ ตอบคำถามนักศึกษาได้ชัดเจน',
        '2_8' => '๘. ใช้วิธีการสอนต่าง ๆ ที่เหมาะสมและมีประสิทธิภาพ',
        '2_9' => '๙. เข้าสอนตรงเวลา',
        '2_10' => '๑๐. เอาใจใส่ผู้เรียนอย่างทั่วถึง',
        '2_11' => '๑๑. รับผิดชอบต่อการสอน',
        '2_12' => '๑๒. ใช้สื่อการสอนได้อย่างเหมาะสมและมีประสิทธิภาพ',
        '2_13' => '๑๓. วัดผลประเมินผลอย่างมีเกณฑ์และยุติธรรม',
        '2_14' => '๑๔. มีกระบวนการสอนรายวิชาตรงตามความคาดหวัง',
        '2_15' => '๑๕. ความพึงพอใจโดยภาพรวมของผู้สอนรายวิชานี้'
    ]
];

$event_ch3 = [
    'ด้านการบริหารและพัฒนาอาจารย์' => [
        '1_1' => '๑. กำหนดบทบาทหน้าที่และความรับผิดชอบของอาจารย์ประจำหลักสูตรมีความชัดเจน',
        '1_2' => '๒. อาจารย์ประจำหลักสูตรมีส่วนร่วมในการประชุมเพื่อวางแผน ติดตาม และทบทวนการดำเนินงานหลักสูตร',
        '1_3' => '๓. ภาระงานที่ได้รับมอบหมายมีความเหมาะสมกับความรู้ความสามารถและประสบการณ์',
        '1_4' => '๔. อาจารย์ประจำหลักสูตรทุกคนได้รับการพัฒนาทางวิชาการ และ/หรือวิชาชีพ อย่างน้อยปีละหนึ่งครั้ง',
        '1_5' => '๕. อาจารย์ได้รับการส่งเสริมให้เข้าสู่ตำแหน่งทางวิชาการและศึกษาต่อ',
        '1_6' => '๖. การประเมินการสอนของอาจารย์ และนำผลมาใช้ในการส่งเสริมพัฒนาความสามารถด้านการสอนของอาจารย์',
        '1_7' => '๗. การมีส่วนร่วมในการให้ข้อเสนอแนะปรับปรุงการบริหารจัดการหลักสูตร'
    ],
    'ด้านกระบวนการบริหารหลักสูตร' => [
        '2_1' => '๑. พัฒนา/ปรับปรุงการจัดการเรียนการสอน กลยุทธ์การสอน หรือการประเมินผลการเรียนรู้ จากผลการประเมินการดำเนินงานที่รายงานใน มคอ. 7 ปีที่แล้ว',
        '2_2' => '๒. กำกับและติดตามการจัดทำรายละเอียดของรายวิชา และประสบการณ์ภาคสนามตามแบบ มคอ.3 และ มคอ.4 อย่างน้อยก่อนการเปิดสอนในแต่ละภาคการศึกษาให้ครบทุกรายวิชา',
        '2_3' => '๓. กำกับและติดตามการจัดทำรายละเอียดของรายวิชา และประสบการณ์ภาคสนามตามแบบ มคอ.5 และ มคอ.6 ภายใน 30 วัน หลังสิ้นสุดภาคการศึกษาให้ครบทุกรายวิชา',
        '2_4' => '๔. การทวนสอบผลสัมฤทธิ์ของนักศึกษาตามมาตรฐานผลการเรียนรู้ ที่กำหนดใน มคอ.3 และ มคอ.4 อย่างน้อยร้อยละ 25 ของรายวิชาที่เปิดสอนในแต่ละปีการศึกษา'
    ],
    'ด้านกระบวนการเรียนการสอน' => [
        '3_1' => '๑. ควบคุมการจัดการเรียนการสอนในวิชาที่มีหลายกลุ่มเรียนให้ได้มาตรฐานเดียวกัน',
        '3_2' => '๒. ส่งเสริมให้อาจารย์ใช้วิธีการสอนใหม่ ๆ ที่พัฒนาทักษะการเรียนรู้ของนักศึกษา',
        '3_3' => '๓. ควบคุมกำกับกระบวนการจัดการเรียนการสอนให้นักศึกษามีผลการเรียนรู้ตามมาตรฐานผลการเรียนรู้ ',
        '3_4' => '๔. ประเมินผลการเรียนรู้ของนักศึกษาตามมาตรฐานผลการเรียนรู้',
        '3_5' => '๕. นำผลการวิจัยหรือกระบวนการวิจัยมาใช้ในการเรียนการสอนและส่งผลต่อการเรียนรู้ของนักศึกษา',
        '3_6' => '๖. นำผลการบริการวิชาการ หรือกระบวนการบริการวิชาการเข้ามามีส่วนร่วมในการจัดการเรียนการสอนและส่งผลต่อการเรียนรู้ของนักศึกษา',
        '3_7' => '๗. สอดแทรกศิลปะและวัฒนธรรม ภูมิปัญญาท้องถิ่น ในกระบวนการเรียนการสอนและส่งผลต่อการเรียนรู้ของนักศึกษาร'
    ],
    'ด้านระบบอาจารย์ที่ปรึกษาวิทยานิพนธ์และการค้นคว้าอิสระ (เฉพาะหลักสูตรระดับบัณฑิตศึกษา)' => [
        '4_1' => '๑. มีการจัดอบรม/ปฐมนิเทศ/ชี้แจงในเรื่องบทบาทหน้าที่อาจารย์ที่ปรึกษาวิทยานิพนธ์และการค้นคว้าอิสระอย่างเหมาะสม',
        '4_2' => '๒. ติดตามและกำกับดูแลผลการทำวิทยานิพนธ์และการค้นคว้าอิสระของนักศึกษาอย่างสม่ำเสมอ',
        '4_3' => '๓. ให้ความช่วยเหลือหรือถ่ายทอดประสบการณ์ด้านการวิจัยและงานสร้างสรรค์แก่นักศึกษา',
        '4_4' => '๔. รับฟังความคิดเห็นและให้คำปรึกษาตลอดจนการช่วยแก้ไขปัญหาต่างๆ',
        '4_5' => '๕. เปิดโอกาสให้นักศึกษาติดต่อสื่อสารได้หลากหลายช่องทาง',
        '4_6' => '๖. มีเวลาเพียงพอในการให้คำปรึกษาแก่นักศึกษา'
    ],
    'ด้านสิ่งสนับสนุนการเรียนรู้' => [
        '5_1' => '๑. อาคารเรียน ห้องเรียน มีความพร้อมต่อการจัดการศึกษา',
        '5_2' => '๒. ทรัพยากรที่เอื้อต่อการเรียนรู้ เช่น อุปกรณ์ เทคโนโลยีสารสนเทศ ห้องสมุด ตำรา หนังสือ แหล่งเรียนรู้ ฐานข้อมูลมีความเหมาะสมต่อการจัดการศึกษา',
        '5_3' => '๓. มีการบำรุงดูแล รักษาทรัพยากรให้เอื้อต่อการเรียนรู้อย่างมีประสิทธิภาพ',
        '5_4' => '๔. เทคโนโลยีที่ใช้ในการจัดการเรียนการสอนมีความเหมาะสม',
        '5_5' => '๕. มีการจัดพื้นที่สำหรับนักศึกษาและอาจารย์ได้พบปะแลกเปลี่ยนความคิดเห็น หรือทำงานร่วมกัน',
        '5_6' => '๖. มีการให้บริการคอมพิวเตอร์ และอินเตอร์เน็ตความเร็วสูง',
        '5_7' => '๗. มีการจัดสรรงบประมาณให้นักศึกษาเพื่อทำวิจัย',
        '5_8' => '๘. มีห้องทำงานวิจัย (ซึ่งไม่ใช่ห้องเรียน) เพื่อให้นักศึกษาเข้าใช้ได้สะดวกในการทำวิจัย',
        '5_9' => '๙. มีอุปกรณ์และเครื่องมือพื้นฐานที่จำเป็นและเหมาะสมในการทำวิจัย'
    ]
];

